Ran Plan for 2 projects:

1. project: `ap` dir: `dev/ap` workspace: `default`
1. project: `bp` dir: `prod/bp` workspace: `default`

### 1. project: `ap` dir: `dev/ap` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform plan -input=false -refresh -no-color -out \"/root/.atlantis/repos/G594805915/altantis-dev/7/default/dev/ap/ap-default.tfplan\"" in "/root/.atlantis/repos/G594805915/altantis-dev/7/default/dev/ap": exit status 1
/root/.atlantis/repos/G594805915/altantis-dev/7/default/dev/ap
total 8
-rw-r--r-- 1 root root 182 Oct 20 16:27 a.tf
-rw-r--r-- 1 root root   4 Oct 20 16:27 bbb
a.tf
bbb
a.tf
bbb


Error: Unsupported argument

  on a.tf line 8, in resource "null_resource" "cluster":
   8:   name  = var.regions[count.index]

An argument named "name" is not expected here.


```
</details>

---
### 2. project: `bp` dir: `prod/bp` workspace: `default`
<details><summary>Show Output</summary>

```diff
/root/.atlantis/repos/G594805915/altantis-dev/7/default/prod/bp
total 12
-rw-r--r-- 1 root root   4 Oct 20 16:27 bbb
-rw-r--r-- 1 root root 363 Oct 20 16:27 main.tf
-rw-r--r-- 1 root root 163 Oct 20 16:27 provider.tf
bbb
main.tf
provider.tf
bbb
main.tf
provider.tf


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_network.vpc will be created
+ resource "google_compute_network" "vpc" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + name                            = "lucas-test-vpc"
      + project                         = (known after apply)
      + routing_mode                    = "REGIONAL"
      + self_link                       = (known after apply)
    }

  # google_compute_subnetwork.subnet will be created
+ resource "google_compute_subnetwork" "subnet" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + gateway_address    = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.2.0.0/18"
      + name               = "lucas-test-subnet01"
      + network            = (known after apply)
      + project            = (known after apply)
      + region             = "us-west1"
      + secondary_ip_range = (known after apply)
      + self_link          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p bp`
* :put_litter_in_its_place: To **delete** this plan click [here](http://proxy.greening.top:80/lock?id=G594805915%252Faltantis-dev%252Fprod%252Fbp%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p bp`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
